<!DOCTYPE html>
<html>
 <head>
  <!-- En-tête de la page -->
  <meta charset="utf-8" />
  <link rel="stylesheet" href="../css/nutyx.css" />
  <title>NuTyX - Installation depuis la mini-iso ou depuis le système de maintenance</title>
 </head>
 <body>
    <header>
      <a href=".."><img id="logo" src="../graphics/logo_nutyx_120.png" alt="logo nutyx" /></a>
    </header>
    <nav>
        <ul>
            <li><a href=".">Home</a></li>
            <li><a href="http://forums.nutyx.org/index.php?action=recent">Forums</a></li>
            <li><a href="irc.html">IRC channel</a></li>
            <li><a href="documentation.html">Documentation</a></li>
            <li><a href="install.html">Installation</a></li>
            <li><a href="information.html">Information</a></li>
            <li><a href="https://twitter.com/nutyx_linux">Twitter</a></li>
            <li><a href="http://git.tuxfamily.org/?p=nutyx/saravane.git">Lasts changes</a></li>
            <li><a href="http://downloads.nutyx.org/saravane/PACKAGES.TXT">Packages</a></li>
        </ul>
    </nav>
<h1>Installation depuis la mini-iso ou depuis le système de maintenance</h1>
<div>La mini-iso ou le système de maintenance permettent d'installer (ou mettre à jour) NuTyX sur votre ordinateur. Cette dernière se trouve dans l'initrd qui est installée sur votre NuTyX. Au démarrage de la machine, il suffit de choisir dans le premier menu: Maintenance de NuTyX</div>
<div>Une fois amorc&eacute;e, le syst&egrave;me de maintenance dispose exactement des m&ecirc;mes  menus que l'iso. Pour la suite de l'explication, j'utiliserai la mini-iso. Donc comme dans le liveD, apr&egrave;s une dizaine de secondes un nouvel &eacute;cran se  pr&eacute;sente comme sur la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/Bienvenue.png" border="0" alt="FIgure 1: Installation depuis le CD" title="FIgure 1: Installation depuis le CD" width="650" height="373" />
<div>Une fois la touche &lt;OK&gt;&nbsp; press&eacute;e, un nouvel &eacute;cran se pr&eacute;sente comme la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/ChoixClavier.png" border="0" alt="Figure 2: Choix du clavier" title="Figure 2: Choix du clavier" width="650" height="370" />
<div>Il est important de choisir imm&eacute;diatement le bon clavier, le choix de celui-ci ne sera plus demand&eacute; lors de  l'installation de NuTyX et donc la m&ecirc;me disposition de clavier sera  utilis&eacute;e dans NuTyX une fois install&eacute;e. D&egrave;s que le clavier sera sp&eacute;cifi&eacute;, un nouvel &eacute;cran appara&icirc;t</div>
<div>Il est tr&egrave;s utile d'avoir des consoles d'acc&egrave;s dans le syst&egrave;me de  maintenance / dans l'iso. Elles vous permettent de faire quelques  petites manipulations si n&eacute;cessaire. Pour y acc&egrave;der, il suffit d'utiliser les fl&egrave;ches de directions gauche et droite ensemble  avec la touche <strong>alt</strong>.</div>
<div>Vous &ecirc;tes maintenant devant le menu principal comme sur la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/MenuPrinipal.png" border="0" alt="Figure 8: Menu Principal" title="Figure 8: Menu Principal" width="630" height="471" />
<div>On va supposer que votre disque dur est d&eacute;j&agrave; pr&eacute;par&eacute; et que les partitions sont cr&eacute;es et format&eacute;es. En effet un article s&eacute;par&eacute; sera d&eacute;velopp&eacute; pour discuter de ce probl&egrave;me. Vous choisisssez donc "Installer NuTyX et son amor&ccedil;age" et avez maintenant la possibilit&eacute;e d'ajuster la date et l'heure.</div>
<img src="http://download.tuxfamily.org/nutyx/img/iso/AjustementHeure.png" border="0" alt="Figure 6: Ajustement de la date et de l'heure" title="Figure 6: Ajustement de la date et de l'heure" width="289" height="221" />
<div>Si vous avez cr&eacute;ez une partition de swap au pr&eacute;alable, l'installateur propose de l'utiliser et elle sera automatiquement reconnue une fois l'installation termin&eacute;e.</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/UtiliserSwap.png" border="0" alt="Figure 11: Activer le swap" title="Figure 11: Activer le swap" width="619" height="241" />
<div>Il suffit ensuite de choisir la partition disponible pour y installer NuTyX comme sur la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/ChoixPartitionPourInstall.png" border="0" alt="Figure 12: Choix de la partition de NuTyX" title="Figure 12: Choix de la partition de NuTyX" width="549" height="270" />
<div>Une fois la partition s&eacute;lectionn&eacute;e, la premi&egrave;re chose &agrave; choisir est le kernel comme sur la figure ci-dessous.</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/install-pakxe.1-1.png" border="0" alt="Figure 13: Choix du kernel" title="Figure 13: Choix du kernel" width="650" />
<div>Ce choix n'est pas indispensable, cad que si vous d&eacute;cidez de ne pas  installer de kernel. Il vous sera possible de le compiler (ou de  l'installer une fois dans la NuTyX install&eacute;e) comme expliqu&eacute; dans la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/install-pakxe.1-2.png" border="0" alt="Figure 14: Pas de kernel" title="Figure 14: Pas de kernel" />
<div>Il est maintenant possible d'installer une interface graphique. Tout comme le kernel, ce choix est optionel, si vous ne souhaitez pas d'interface graphique, pressez &lt;suivant&gt; dans la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/install-pakxe.1-3.png" border="0" alt="Figure 15: Choix de l'interface graphique" title="Figure 15: Choix de l'interface graphique" width="680" height="240" />
<div>Si vous avez fait votre choix pour une interface graphique, vous pourrez ensuite choisir des applications suppl&eacute;mentaire non install&eacute;es par d&eacute;faut comme sur la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/install-pakxe.1-4.png" border="0" alt="Figure 16: Choix des applications suppl&eacute;mentaires" title="Figure 16: Choix des applications suppl&eacute;mentaires" width="717" height="464" />
<div>Chaque groupe d'applications est constitu&eacute; d'une liste d'applications parmis laquelle on peut ajouter des applications.</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/install-pakxe.1-5.png" border="0" alt="Figure 17: Choix d'applications dans un groupe" title="Figure 17: Choix d'applications dans un groupe" width="680" height="385" />
<div>Une fois les s&eacute;lections termin&eacute;es, l'installation de NuTyX commence et les paquets sont t&eacute;l&eacute;charg&eacute;s et install&eacute;s comme dans la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/InstallEnCours.png" border="0" alt="Figure 17: Installation en cours" title="Figure 17: Installation en cours" width="680" height="388" />
<div>Une fois l'installation de tous les paquets termin&eacute;e, l'installateur vous demande d'entrer le nom d'utilisateur courant cad l'utilisateur qui utilisera le plus souvent NuTyX comme dans la figure ci-dessous.</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/ChoixNomUtilsateur.png" border="0" alt="Figure 18: Choix du nom d'utilisateur" title="Figure 18: Choix du nom d'utilisateur" width="680" height="388" />
<div>Ensuite il faut sp&eacute;cifier le mot de passe du compte root (compte administrateur de la machine) comme sur la figure ci-dessous</div>
<img src="http://download.tuxfamily.org/nutyx/img/pakxe.1/MINI/MotdePasseRoot.png" border="0" alt="Figure 19: Mot de passe compte root" title="Figure 19: Mot de passe compte root" width="680" height="388" />
<div>D&egrave;s que le mot de passe du compte root est activ&eacute;, l'installation se termine et vous pourez si vous le souhaitez <a href="grub-install.html">installer GRUB</a>.</div>
<div>Bonne installation</div>
  </div>
  <div class="pied_page"> ... <img src="../graphics/logo_nutyx_25.png"> ...
  </div>
 </body>
</html>
